app/views/components/_footer.html.erb

                    <ul>
                    <% if Article.order('created_at DESC').size != 0 %>
                        <% Article.order('created_at DESC').limit(4).each do |article| %>
---
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 5